
from appium.webdriver.common.appiumby import AppiumBy as By

from utils.locators import by_text

VERSION_FIXES = {
    "1, 20.05.25": "- Добавлена работа с наборами",
    "2, 29.05.25": "- Добавлены переменные weight_04 и weight_05",
    "3, 18.06.25": "Добавлено:",
    "4, 25.06.25": "- В быстрое изменение агрегата добавлена возможность игнорировать задание",
    "5, 03.07.25": "- Исправлена ошибка при работе с типографскими кодами. Когда в БД записывался неправильно криптохвост",
    "6, 07.07.25": "- Исправлена ошибка при работе с 4х значными типографскими кодами. Когда в БД записывался неправильно криптохвост",
    "7, 21.07.25": "- Исправлена ошибка при работе с переменной slifetime",
    "10, 23.07.25": "- Добавлена работа с белорусскими кодами агрегата",
    "11, 23.07.25": "- Добавлена возможность агрегировать 0 и 1 уровень одновременно вовремя сериализации. Теперь в тот момент, когда вы берёте задание в работу по сериализации и есть несколько уровней агрегации приложение задаст вопрос и выведет кнопки в виде списка названий нулевого и первого уровня агргегации, а так же кнопка «Нет» - что бы выполнить сериализацию без агрегирования",
    "12, 21.08.25": "- Интеграция с ТСД АТОЛ Smart M20",
    "13, 25.08.25": "- Добавлена обработка переменной cell",
    "14, 05.09.25": "- Добавлена возможность печатать через old printer (Работает только с шаблонами из DMC (Не редактор этикеток))",
    "15, 19.09.25": " - Убран приоритет при выборе шаблона, который находился где штучный шаблон",
    "16, 30.09.25": "- Срок годности теперь сперва берётся из задания, из переменной expiration_date",
    "17, 02.10.25": "- В коде информации по коду в результате агрегации добавлено наименование продукции",
    "18, 02.10.25": "- Логи переехали в Download/dmc/logs/",
    "19, 10.10.25": "- В документ логирования теперь записываются последние 10 запросов",
    "20, 29.10.25": "- Приложение обновилось на новую платформу, что уменьшает размер apk-файла",
    "20.5, 10.11.25": "- Добавлена переменная pack_ean13barcode",
    "20.7, 19.11.25": "- Добавлена проверка-поиск штучного кода в агрегатах",
    "20.76, 09.12.25": "- Добавлено обработка условий в переменных",
    "20.8, 16.12.25": "- Добавлена настройка выбора языка принтера, для oldprinter ",
    "20.10, 19.12.25": "- При отбраковке весового агрегата теперь вычисляется вес, в задание и родителе ",
    "20.11, 25.12.25": "- Исправлено, когда в версиях с 20.7.7 при повторе печати принтер брался из линии, а не ранее выбранный незанятый принтер",
    "20.12, 30.12.25": "- Исправлена ошибка, когда в быстрой агреганции могли не добавляться и изыматься коды",
    "21, 20.01.26": "- Добавлено обновление счётчика напечатанных кодов агрегатов",
    "22, 30.12.25": "- В печати вложений теперь можно выбрать язык принера",
    "23, 30.03.26": "- При первом запуске приложения, ip-адрес сервера установлен - 0.0.0.0 и приложение перенаправляет в настройки",
    "23r2, 07.04.26": "- Исправлено, когда новые версии ТСД не отображались в ЛК DMC",
    "24, 30.04.26": "- Исправлено когда product0 не брался, если в конце строки не было переноса",
    "25, 09.06.26": "- Исправлено, если описание в карточке продукции было написано в одну строку, а в шаблоне присутствовала переменная с индексом более 0, печать не происходила",
}
